// 미완료 해결 과제


/* 7장4절 [ 문제 2 ] 
배열에 7개의 문자를 입력 받아서 저장하시오
문자 중에서 cat가 몇 번 있는지 횟수를 출력하시오. cat 가 이어진 경우만 찾는다. */


/* 7장5절 [ 문제 5 ] 
영어 문자 다섯 개를 입력 받아서, 예시와 같이 
한 번에 한 칸씩 shift해서 출력하는 프로그램을 작성하시오. */


/* 7장4절 [ 문제 6 ] 
(Hangman) 정답이 되는 3글자의 영단어를 입력한 후 엔터키를 누른다. 
- 정답을 맞추기 위하여 한 글자씩 입력한 후 엔터키를 누른다. 
- 5번까지 시도할 수 있다. - 글자를 입력할 때 마다 현재 상태를 화면에 출력한다. 
- 정답을 맞추거나, 5번이 경과하면 프로그램은 종료된다. 

Hint: 문자 입력 후에는 getchar( ) 함수를 추가하여 엔터 문자를 버퍼에서 제거해야, 
다음에 문자 입력이 정상적으로 실행된다. 
즉 cat? 입력 다음에 문자 입력이 있으므로, cat? 입력 다음에 getchar( ) 추가해야 한다. */


/* [ 문제 7 ] 
10개의 정수를 입력 받는다. 
각 정수가 몇 번 등장했는지를 입력받은 순서대로 출력하시오. 
입력 받은 숫자와 총 입력 횟수를 함께 출력하시오. 동일한 숫자에 대해서는 한번만 출력하시오.
*/

/*  7장5절 [ 문제 13 ] 
 2차원 배열 x에 3X3 정수로 된 행렬을 입력하시오. 
 - 2차원 배열 y에 2X2 정수로 된 행렬을 입력하시오. 
 - x 행렬에서 y 행렬이 어디에 있는지, x에서 y 행렬 시작위치의 행 번호와 열 번호를 출력하시오. 
 - 첫 번째 나타나는 y 행렬의 행 과 열 번호를 쓰시오. 
 - 없는 경우에는 “none”을 출력하시오. */